{
    "pt": {
        "nav_about": "Sobre Nós",
        "nav_projects": "Projetos",
        "nav_events": "Eventos",
        "nav_members": "Membros",
        "nav_contact": "Contato",
        "hero_title": "Liga Acadêmica de Estudos Moleculares",
        "hero_subtitle": "Integrando ensino, pesquisa e extensão para transformar a ciência em ação.",
        "section_about_title": "Sobre Nós",
        "section_about_text": "A Liga Acadêmica de Estudos Moleculares (LAEM) é uma organização acadêmica dinâmica e inovadora, vinculada à Universidade Federal de Pernambuco (UFPE), que se dedica a aprofundar e disseminar o conhecimento nas áreas de genética, bioquímica e biologia molecular. Nosso propósito é construir uma ponte sólida entre a teoria universitária e a prática cotidiana, promovendo a integração essencial entre o ensino, a pesquisa e a extensão. Com um forte compromisso social, trabalhamos para levar o conhecimento científico de ponta, produzido dentro dos muros da universidade, diretamente para a comunidade escolar e a sociedade em geral, utilizando uma linguagem acessível, prática e engajadora.",
        "carousel_placeholder": "Carrossel de imagens da liga em breve.",
        "section_projects_title": "Projetos de Pesquisa",
        "project_diagnosis_title": "Diagnóstico Molecular",
        "project_diagnosis_desc": "Explorando técnicas avançadas para a identificação precisa de patógenos e doenças em nível molecular.",
        "project_biomarker_title": "Pesquisa de Biomarcadores",
        "project_biomarker_desc": "Investigando marcadores biológicos para o desenvolvimento de novos métodos de diagnóstico e prognóstico.",
        "project_therapies_title": "Novas Terapias",
        "project_therapies_desc": "Pesquisando abordagens terapêuticas inovadoras com base em alvos moleculares para o tratamento de doenças.",
        "project_hpv_title": "Divulgação Científica em HPV",
        "project_hpv_desc": "Nosso projeto, intitulado 'Conceitos da saúde e biologia molecular na conscientização do HPV', busca desmistificar o tema e promover a saúde preventiva por meio de uma abordagem lúdica e dialógica.",
        "section_events_title": "Próximos Eventos",
        "section_members_title": "Nossos Membros",
        "filter_presidency": "Presidência",
        "filter_teaching": "Ensino/Científico",
        "filter_extension": "Extensão",
        "filter_communication": "Comunicação",
        "section_contact_title": "Contato",
        "footer_rights": "© {year} LAEM - Liga Acadêmica de Estudos Moleculares. Todos os direitos reservados.",
        "btn_lattes": "Currículo Lattes",
        "btn_subscribe": "Inscreva-se",
        "btn_closed": "Inscrições Encerradas",
        "msg_error_events": "Erro ao carregar os eventos. Tente novamente mais tarde.",
        "msg_no_events": "A liga não está sediando eventos no momento. Por favor, verifique posteriormente para novas oportunidades.",
        "msg_error_members": "Erro ao carregar os membros.",
        "msg_no_members": "Nenhum membro encontrado para esta categoria."
    },
    "en": {
        "nav_about": "About Us",
        "nav_projects": "Projects",
        "nav_events": "Events",
        "nav_members": "Members",
        "nav_contact": "Contact",
        "hero_title": "Academic League of Molecular Studies",
        "hero_subtitle": "Integrating teaching, research, and extension to transform science into action.",
        "section_about_title": "About Us",
        "section_about_text": "The Academic League of Molecular Studies (LAEM) is a dynamic and innovative academic organization linked to the Federal University of Pernambuco (UFPE), dedicated to deepening and disseminating knowledge in the areas of genetics, biochemistry, and molecular biology. Our purpose is to build a solid bridge between university theory and everyday practice, promoting the essential integration between teaching, research, and extension. With a strong social commitment, we work to bring cutting-edge scientific knowledge, produced within the university walls, directly to the school community and society in general, using accessible, practical, and engaging language.",
        "carousel_placeholder": "League image carousel coming soon.",
        "section_projects_title": "Research Projects",
        "project_diagnosis_title": "Molecular Diagnosis",
        "project_diagnosis_desc": "Exploring advanced techniques for precise identification of pathogens and diseases at the molecular level.",
        "project_biomarker_title": "Biomarker Research",
        "project_biomarker_desc": "Investigating biological markers for the development of new diagnostic and prognostic methods.",
        "project_therapies_title": "New Therapies",
        "project_therapies_desc": "Researching innovative therapeutic approaches based on molecular targets for disease treatment.",
        "project_hpv_title": "HPV Science Communication",
        "project_hpv_desc": "Our project, titled 'Health concepts and molecular biology in HPV awareness', seeks to demystify the topic and promote preventive health through a playful and dialogical approach.",
        "section_events_title": "Upcoming Events",
        "section_members_title": "Our Members",
        "filter_presidency": "Presidency",
        "filter_teaching": "Teaching/Scientific",
        "filter_extension": "Extension",
        "filter_communication": "Communication",
        "section_contact_title": "Contact",
        "footer_rights": "© {year} LAEM - Academic League of Molecular Studies. All rights reserved.",
        "btn_lattes": "Lattes Curriculum",
        "btn_subscribe": "Subscribe",
        "btn_closed": "Registration Closed",
        "msg_error_events": "Error loading events. Please try again later.",
        "msg_no_events": "The league is not hosting events at the moment. Please check back later for new opportunities.",
        "msg_error_members": "Error loading members.",
        "msg_no_members": "No members found for this category."
    },
    "es": {
        "nav_about": "Sobre Nosotros",
        "nav_projects": "Proyectos",
        "nav_events": "Eventos",
        "nav_members": "Miembros",
        "nav_contact": "Contacto",
        "hero_title": "Liga Académica de Estudios Moleculares",
        "hero_subtitle": "Integrando enseñanza, investigación y extensión para transformar la ciencia en acción.",
        "section_about_title": "Sobre Nosotros",
        "section_about_text": "La Liga Académica de Estudios Moleculares (LAEM) es una organización académica dinámica e innovadora, vinculada a la Universidad Federal de Pernambuco (UFPE), dedicada a profundizar y difundir el conocimiento en las áreas de genética, bioquímica y biología molecular. Nuestro propósito es construir un puente sólido entre la teoría universitaria y la práctica cotidiana, promoviendo la integración esencial entre la enseñanza, la investigación y la extensión. Con un fuerte compromiso social, trabajamos para llevar el conocimiento científico de vanguardia, producido dentro de los muros de la universidad, directamente a la comunidad escolar y a la sociedad en general, utilizando un lenguaje accesible, práctico y atractivo.",
        "carousel_placeholder": "Carrusel de imágenes de la liga próximamente.",
        "section_projects_title": "Proyectos de Investigación",
        "project_diagnosis_title": "Diagnóstico Molecular",
        "project_diagnosis_desc": "Explorando técnicas avanzadas para la identificación precisa de patógenos y enfermedades a nivel molecular.",
        "project_biomarker_title": "Investigación de Biomarcadores",
        "project_biomarker_desc": "Investigando marcadores biológicos para el desarrollo de nuevos métodos de diagnóstico y pronóstico.",
        "project_therapies_title": "Nuevas Terapias",
        "project_therapies_desc": "Investigando enfoques terapéuticos innovadores basados en objetivos moleculares para el tratamiento de enfermedades.",
        "project_hpv_title": "Divulgación Científica sobre VPH",
        "project_hpv_desc": "Nuestro proyecto, titulado 'Conceptos de salud y biología molecular en la concientización del VPH', busca desmitificar el tema y promover la salud preventiva a través de un enfoque lúdico y dialógico.",
        "section_events_title": "Próximos Eventos",
        "section_members_title": "Nuestros Miembros",
        "filter_presidency": "Presidencia",
        "filter_teaching": "Enseñanza/Científico",
        "filter_extension": "Extensión",
        "filter_communication": "Comunicación",
        "section_contact_title": "Contacto",
        "footer_rights": "© {year} LAEM - Liga Académica de Estudios Moleculares. Todos los derechos reservados.",
        "btn_lattes": "Currículum Lattes",
        "btn_subscribe": "Inscribirse",
        "btn_closed": "Inscripciones Cerradas",
        "msg_error_events": "Error al cargar los eventos. Inténtelo de nuevo más tarde.",
        "msg_no_events": "La liga no está organizando eventos en este momento. Por favor, verifique más tarde para nuevas oportunidades.",
        "msg_error_members": "Error al cargar los miembros.",
        "msg_no_members": "No se encontraron miembros para esta categoría."
    }
}
